quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question' : 'Какую сумму Эдди проиграл Гарри-Топору в фильме Гая Ричи «Карты, деньги, два ствола»??',
        'options' : ['500 тысяч фунтов', '360 тысяч шекелей', '20 тысяч долларов', '4300 евро'],
        'correct_option' : 0
    },
    {
        'question' : 'Квадратный корень из числа π (пи)?',
        'options' : ['1.88', '1.86', '1.85', '2.1'],
        'correct_option' : 0
    },
    {
        'question' : 'В каком году появился первый релиз Python?',
        'options' : ['1991', '1996', '1983', '1988'],
        'correct_option' : 0
    },
    {
        'question' : 'Как импортировать всю библиотеку math?',
        'options' : ['import math', 'def math', 'math()', '!pip instal math'],
        'correct_option' : 0
    },
    {
        'question' : 'Когда была создана первая модель нейронной сети?',
        'options' : ['1943', '1950', '1956', '1987'],
        'correct_option' : 0
    },
    {
        'question' : 'Когда создали первую компьютерную симуляцию животного?',
        'options' : ['Кошечку в 1968', 'Лошадку в 1995', 'Собачку в 2000', 'Птичку в 1992'],
        'correct_option' : 0
    },
    {
        'question' : 'Кто сказал: «Даже мудрейшие не могут предвидеть всего»?',
        'options' : ['Гэндальф', 'Жириновский', 'Ницше', 'Пётр 1'],
        'correct_option' : 0
    },
    {
        'question' : 'Как зовут собаку Хагрида?',
        'options' : ['Клык', 'Бим', 'Босс', 'Щенок'],
        'correct_option' : 0
    },
]
